cats99/app/controllers/cat_rental_requests_controller.rb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"
---
  def index
    @requests = CatRentalRequest.all

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @request = CatRentalRequest.find(params[:id])

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 3], ["start_date", "2019-01-09"], ["end_date", "2019-02-06"], ["created_at", "2018-11-14 01:03:04.773063"], ["updated_at", "2018-11-14 01:03:04.773063"]]
---
  def create
    @request = CatRentalRequest.new(rental_params)
    if @request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def approve
    @request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def deny
    @request = CatRentalRequest.find(params[:id])