cats99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("name", "created_at", "updated_at", "birth_date", "color", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    if @cat.save