cats99/app/models/cat_rental_request.rb

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND NOT (start_date > '2018-11-13') AND NOT (end_date < '2018-11-13') AND (status = 'APPROVED') LIMIT $2  [["cat_id", 2], ["LIMIT", 1]]
---
  def does_not_overlap_approved_request
    if !overlapping_approved_requests.empty?

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2018-11-14 01:47:17.452399"], ["id", 2]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 AND NOT (start_date > '2018-11-13') AND NOT (end_date < '2018-11-13') AND (status = 'PENDING')  [["cat_id", 2]]
---
  def approve!
    self.update_attributes(status: 'APPROVED')
    overlapping_pending_requests.each { |el| el.deny! }

UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2018-11-14 01:51:08.693187"], ["id", 3]]
---
  def deny!
    self.update_attributes(status: 'DENIED')