cats99/app/views/cat_rental_requests/_request_form.html.erb

SELECT "cats".* FROM "cats"
---
    <select name="request[cat_id]">
      <% Cat.all.each do |cat| %>