cats99/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests" ORDER BY "cat_rental_requests"."start_date" ASC
---
  </tr>
  <% CatRentalRequest.all.order(:start_date).each do |crr| %>